<?php
$data = ["apple", "banana", "cherry"];
// print $data[1]; // banana
$data[] = "orange"; // 末尾に要素を追加
print_r($data);
/* 
    Array(
        [0] => apple
        [1] => banana
        [2] => cherry
        [3] => orange
    )
*/


//--------------------------------------------------
// 連想配列
$members = [
    '山田' => '男',
    '勝沼' => '女',
    '宮川' => '女',
    '長谷部' => '男',
    '国頭' => '男',
];
// print $members['山田']; // 男
print_r($members);
/* 
    Array(
        [山田] => 男
        [勝沼] => 女
        [宮川] => 女
        [長谷部] => 男
        [国頭] => 男
    )
*/


//--------------------------------------------------
// 多次元配列
$coordinates = [
    ['X-1', 'X-2', 'X-3'],
    ['Y-1', 'Y-2', 'Y-3'],
    ['Z-1', 'Z-2', 'Z-3'],
];
// print $coordinates[1][2]; // Y-3
print_r($coordinates);
/* 
    Array(
        [0] => Array(
            [0] => X-1
            [1] => X-2
            [2] => X-3
        )
        [1] => Array(
            [0] => Y-1
            [1] => Y-2
            [2] => Y-3
        )
        [2] => Array(
            [0] => Z-1
            [1] => Z-2
            [2] => Z-3
        )
    )
*/

// 配列の中に連想配列を含めることも可能
$data2 = [
    [
        'name' => '山田',
        'age' => 20,
        'city' => '東京',
    ],
    [
        'name' => '伊藤',
        'age' => 24,
        'city' => '埼玉',
    ],
    [
        'name' => '田中',
        'age' => 28,
        'city' => '千葉',
    ],
];
?>
