// n
use proconio::input;

fn main() {
    input! {
        n: i32,
    };
}

/* ============================================================================== */

// a b
use proconio::input;

fn main() {
    input! {
        a: i32,
        b: i32,
    };
}

/* ============================================================================== */

// n
// v1 v2 ... vn
use proconio::input;

fn input2() {
    input! {
        n: usize, // nはvを受け取る際のインデックスとして使用する。このような場合やfor文などでインデックスとして使用される場合はusizeで受け取らないとコンパイルエラーになる
        v: [i32; n],
    };
}

/* ============================================================================== */

// 文字列の標準入力
use proconio::input;

fn input4() {
    input! {
        S: String,
    };
}

/* ============================================================================== */

// n
// a1 b1
// a2 b2
// ...
// an bn
use proconio::input;

fn input5() {
    input! {
        n: usize,
    };

    for _ in 0..n {
        input! {
            a: String,
            b: i32,
        };
    }
}

/* ============================================================================== */

// n
// a1
// a2
// ...
// an
use proconio::input;

fn main() {
    input! {
        n: usize,
        names: [String; n],
    }
}

/* ============================================================================== */

// a b
// c d

use proconio::input;

fn main() {
    input! {
        a: i32,
        b: i32,
        c: i32,
        d: i32,
    }
}

/* ============================================================================== */

// H, W
// S(1,1) S(1,2) ... S(1,W)
// S(2,1) S(2,2) ... S(2,W)
// S(3,1) S(3,2) ... S(3,W)
// ...
// S(H,1) S(H,2) ... S(H,W)

use proconio::input;
use proconio::marker::Chars;
// use proconio::{input, marker::Chars};  とすれば１行で記述可能

fn main() {
    input! {
        h: usize,
        w: usize,
        s: [Chars; h],  // h 行分の入力を受け取る
    };
}

/* ============================================================================== */

// N
// A1 
// A1 A2
// ...
// A1 A2 ... An

use proconio::input;

fn main() {
    input! {
        n: usize,
        a: [[usize; n]; n]
    }
}